# Pandas Crash Course / Workbook

- what is a pd.Series
  - [answer](https://pandas.pydata.org/docs/user_guide/dsintro.html#series)
- what is a pd.DataFrame
  - [answer](https://pandas.pydata.org/docs/user_guide/10min.html#basic-data-structures-in-pandas)
- how are pandas and numpy related?
- how is pandas different/'better' than a 2D numpy matrix

### Numpy Array Basics
ISLP pdf pg. 52 (notes in markdown)
<!-- 
- numpy
  - 2.3.3
  - 2.3.5
  - 2.3.6 - up to #60 (feel free to read the rest, but you DON"T NEED TO KNOW IT)
- pandas
  - 2.3.7
  - 2.3.8 optional
- assessing model accuracy
  - 3.1.3
 -->

In [2]:
import numpy as np

# create an array of numbers from 1 to 10
np.arange(1,11)

# using a list 
np.array(list(range(1,11)))
np.array([1,2,3,4,5,6,7,8,9,10])


# create an array of random numbers, len 10
np.random.rand(10)
# show the length of the array
len(np.random.rand(10))
# alt
np.random.rand(10).shape

# create a 2D array (2,3) of random numbers
np.random.rand(2,3)
# HINT: np.random.rand?

array([[0.88579235, 0.71606708, 0.12651413],
       [0.43662694, 0.87515202, 0.80440761]])

In [23]:
# create an array of numbers ordered 0 to 9; named x
x = np.arange(10)

# slice the 0th value of the array
x[0]
# slice the last value of the array
x[-1]

# slice the last 3 values from the 1D array i.e. [7,8,9]
x[-3:]
# slice the 3rd to the 6th (inclusive) valumes from the array i.e. [3,4,5,6]
x[3:7]

array([3, 4, 5, 6])

## Pandas Basics

In [4]:
import pandas as pd
from IPython.display import display

### Create a DataFrame

In [37]:
# create a dataframe with 3 columns
# - "pet"    which has cat, dog, cat, cat, bird
# - "height" which has 1, 2, 1.2, .9, .3
# - "length" which has 1.6, 2.2, 1.5, 1, .1
# - "name"   which has alan, bob, chris, dave, ed


# a column centric view of the data
d = {
    "pet" : ["cat", "dog", "cat", "cat", "bird"],
    "height" : [1, 2, 1.2, .9, .3],
    "length" : [1.6, 2.2, 1.5, 1, .1],
    "name" : ["alan", "bob", "chris", "dave", "ed"],
}

df = pd.DataFrame(d)
df

    pet  height  length   name
0   cat     1.0     1.6   alan
1   dog     2.0     2.2    bob
2   cat     1.2     1.5  chris
3   cat     0.9     1.0   dave
4  bird     0.3     0.1     ed

In [5]:
# the same problem as above but with a row-centric view of the data
# this is more 'natural' if the data is organized by row (i.e. pet-data)
a = ["cat", 1, 1.6, "alan"]
b = ["dog", 2, 2.2, "bob"]
c = ["cat", 1.2, 1.5, "chris"]
d = ["cat", .9, 1, "dave"]
e = ["bird", .3, .1, "ed"]

df = pd.DataFrame([a,b,c,d,e], columns=["pet", "height", "length", "name"])
df

    pet  height  length   name
0   cat     1.0     1.6   alan
1   dog     2.0     2.2    bob
2   cat     1.2     1.5  chris
3   cat     0.9     1.0   dave
4  bird     0.3     0.1     ed

In [48]:
max_pet = df.groupby(by=['pet'], as_index=False).max()
max_pet[max_pet['pet'] == 'cat']['name']

1    dave
Name: name, dtype: object

### Display Counts - i.e. Frequency Table

In [41]:
# display a table of the pet categories HINT 'count' of 'values'
df["pet"].value_counts()

# display the same table but instead of absolute counts, show the % of the data for each category
# HINT look at the function args
df["pet"].value_counts(normalize=True)

pet
cat     0.6
dog     0.2
bird    0.2
Name: proportion, dtype: float64

### Challenge 1 - Find the tallest cat

In [57]:
# select the tallest cat from the dataframe - what is the name?

# ans: filter to only cats, sort values take top height (general solution)
cats = df[df["pet"] == "cat"]
print("filter")
display(cats)

cats = cats.sort_values("height", ascending=False)
print("sort")
display(cats)

# get the first row i.e. .iloc[0] get the name i.e. ['name']
print(cats.iloc[0]["name"])

filter

   pet  height  length   name
0  cat     1.0     1.6   alan
2  cat     1.2     1.5  chris
3  cat     0.9     1.0   dave

sort

   pet  height  length   name
2  cat     1.2     1.5  chris
0  cat     1.0     1.6   alan
3  cat     0.9     1.0   dave

chris

In [60]:
# everything above as a one-liner
df[df["pet"] == 'cat'].sort_values("height", ascending=False).iloc[0]["name"]

# same as above but with query to perform filtering - this syntax is non-standard FYI only
# df.query("pet == 'cat'").sort_values("height", ascending=False).iloc[0]["name"]

'chris'

### Challenge 2 - Find the shortest name

In [71]:
# select the shortest name from the df - what name is it?

# ans: get an array of name string lengths
str_len = df["name"].str.len()
print("-"*20,"array of str lengths","-"*20, sep="\n")
print(str_len)

# get a bool array of the names that equal min str length
mask = str_len == str_len.min()
print("-"*20,"mask", "-"*20, sep="\n")
print(mask)

# mask the array and get the names
print("-"*20,"shortest name","-"*20, sep="\n")
df[mask]["name"]

--------------------
array of str lengths
--------------------
0    4
1    3
2    5
3    4
4    2
Name: name, dtype: int64
--------------------
mask
--------------------
0    False
1    False
2    False
3    False
4     True
Name: name, dtype: bool
--------------------
shortest name
--------------------

4    ed
Name: name, dtype: object

### Column Manipulations

In [73]:
# order the dataframe according to height ascending
# df = df.sort_values("height", ascending=True)
df.sort_values("height", ascending=True, inplace=True)
display(df)

    pet  height  length   name
4  bird     0.3     0.1     ed
3   cat     0.9     1.0   dave
0   cat     1.0     1.6   alan
2   cat     1.2     1.5  chris
1   dog     2.0     2.2    bob

In [74]:
# create a column named area which is the length times height
df["area"] = df["length"] * df["height"]
display(df)

    pet  height  length   name  area
4  bird     0.3     0.1     ed  0.03
3   cat     0.9     1.0   dave  0.90
0   cat     1.0     1.6   alan  1.60
2   cat     1.2     1.5  chris  1.80
1   dog     2.0     2.2    bob  4.40

In [75]:
# drop the column area
df = df.drop(columns=["area"])
display(df)

    pet  height  length   name
4  bird     0.3     0.1     ed
3   cat     0.9     1.0   dave
0   cat     1.0     1.6   alan
2   cat     1.2     1.5  chris
1   dog     2.0     2.2    bob

### Challenge 3 - Add a Row of Data
This is problem is a one-row version of "stacking" dataframes (i.e. UNION in SQL)

In [128]:
# create a copy of the df
x = df.copy(deep=True)

# add a row with ["dog", 2, 3, "frank"]
f = ["dog", 2, 3, "frank"]
# here we add an index and assign data f
x.loc[len(x)] = f
# display(x)

# alternative we can concat 2 dataframes
# this is the more typical usecase when UNION two dataframes
# adding a row is a 'special case'
x = df.copy(deep=True)

# this is a little ugly
f_ = pd.DataFrame(f).T
f_.columns = x.columns
display(f_)

   pet height length   name
0  dog      2      3  frank

In [127]:
# we could change our data to make it less ugly i.e.
# the syntax here is more complex though
f2_ = pd.DataFrame.from_dict({col: data for col, data in zip(x.columns, f)}, orient="index")
display(f2_)

# note we need to transpose f2_ to align with the other df's orientation
f2_ = f2_.T
display(f2_)

# concat is a STANDARD technique for combining data!
pd.concat([x, f2_], ignore_index=True)

            0
pet       dog
height      2
length      3
name    frank

   pet height length   name
0  dog      2      3  frank

    pet height length   name
0  bird    0.3    0.1     ed
1   cat    0.9    1.0   dave
2   cat    1.0    1.6   alan
3   cat    1.2    1.5  chris
4   dog    2.0    2.2    bob
5   dog      2      3  frank

### Subset DataFrames & Index Adjustments
The key concept here is that df's return copies... and you have to be explicit about returning a copy (with some adjustment) vs. mutating the dataframe

In [140]:
# select the subset of columns pet, name - as a new dataframe
new = df[["pet", "name"]].copy(deep=True)
new

# select only cats
display(new[new["pet"] == "cat"])

# set the index to name - perminantly
new = new.set_index("name")
# alt: new.set_index("name", inplace=True)

# reset the index - perminantly
new = new.reset_index()
# alt: new.reset_index(inplace=True)

# delete new
del new
display(new) # this should fail!

   pet   name
3  cat   dave
0  cat   alan
2  cat  chris

NameError: name 'new' is not defined

### DataFrame Filtering

In [143]:
# filter the dataframe to only dogs
df[df["pet"] == "dog"]

# filter the dataframe to only height >= 1
df[df["height"] >= 1]

# filter the dataframe to only names ed and alan
df[df["name"].isin(["ed", "alan"])]

    pet  height  length  name
4  bird     0.3     0.1    ed
0   cat     1.0     1.6  alan

### String Operations

In [151]:
# rename all the columns to be uppercase
df.columns = [c.upper() for c in df.columns]
display(df)

# set all the columns back to lowercase
df.columns = [c.lower() for c in df.columns]

# rename all the names to be capitalized HINT check string methods
# set the capatalized values as the values in the df!
df["name"] = df["name"].str.capitalize()
display(df)

    PET  HEIGHT  LENGTH   NAME
4  bird     0.3     0.1     ed
3   cat     0.9     1.0   dave
0   cat     1.0     1.6   alan
2   cat     1.2     1.5  chris
1   dog     2.0     2.2    bob

    pet  height  length   name
4  bird     0.3     0.1     Ed
3   cat     0.9     1.0   Dave
0   cat     1.0     1.6   Alan
2   cat     1.2     1.5  Chris
1   dog     2.0     2.2    Bob